Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# toolbar.status.github.state.operational
source: API Requests operational
zh_hans: API Requests 正常

# toolbar.status.github.state.partialOutage
source: API Requests partial outage
zh_hans: API Requests 部分中断

# toolbar.status.github.state.unknown
source: API Requests status unknown
zh_hans: API Requests 状态未知

# toolbar.status.github.summaryFormat
source: %1$@ · updated %2$@
zh_hans: %1$@ · %2$@更新

# toolbar.status.github.summaryWithIncidentsFormat
source: %1$@ · active incidents: %2$d · updated %3$@
zh_hans: %1$@ · %2$d 个相关事件 · %3$@更新

# toolbar.status.github.summaryWithOtherIncidentsFormat
source: %1$@ · other GitHub incidents: %2$d · updated %3$@
zh_hans: %1$@ · GitHub 其他服务有 %2$d 个事件 · %3$@更新

# toolbar.status.github.title
source: GitHub Status
zh_hans: GitHub 状态

# toolbar.status.github.unavailable
source: GitHub's official status is temporarily unavailable.
zh_hans: 暂时无法获取 GitHub 官方状态。

# widget.collectionTrend.configuration.description
source: Choose a color palette for this heatmap.
zh_hans: 为这个热力图选择配色。

# widget.collectionTrend.configuration.palette
source: Heatmap palette
zh_hans: 热力图配色

# widget.collectionTrend.configuration.title
source: Customize Star Rhythm
zh_hans: 自定义收藏趋势

# widget.collectionTrend.description
source: See how your public GitHub stars changed over the last 12 weeks.
zh_hans: 查看最近 12 周公开 GitHub 收藏的变化节奏。

# widget.collectionTrend.displayName
source: Star Rhythm
zh_hans: 收藏趋势

# widget.collectionTrend.empty.subtitle
source: Open Starcat to publish the latest trend snapshot.
zh_hans: 打开 Starcat 以生成最新趋势快照。

# widget.collectionTrend.empty.title
source: Trend Not Ready
zh_hans: 趋势尚未就绪

# widget.collectionTrend.heatmapDescription
source: See the daily rhythm of your public GitHub stars over the last 26 weeks.
zh_hans: 查看最近 26 周公开 GitHub 收藏的每日节奏。

# widget.collectionTrend.last30Days
source: Last 30 days
zh_hans: 近 30 天

# widget.collectionTrend.openInsights
source: Open My Insights in Starcat
zh_hans: 在 Starcat 中打开我的洞察

# widget.collectionTrend.palette.ember
source: Ember
zh_hans: 余烬

# widget.collectionTrend.palette.evergreen
source: Evergreen
zh_hans: 常青

# widget.collectionTrend.palette.nordic
source: Nordic
zh_hans: 北境

# widget.collectionTrend.palette.ocean
source: Ocean
zh_hans: 海洋

# widget.collectionTrend.palette.system
source: System
zh_hans: 跟随系统

# widget.collectionTrend.palette.type
source: Heatmap palette
zh_hans: 热力图配色

# widget.collectionTrend.publicScope
source: Public stars
zh_hans: 公开收藏

# widget.collectionTrend.read
source: Read
zh_hans: 已读

# widget.collectionTrend.thisWeek
source: This week
zh_hans: 本周

# widget.collectionTrend.title
source: Star Rhythm
zh_hans: 收藏趋势

# widget.collectionTrend.total
source: Total
zh_hans: 总计

# widget.collectionTrend.unread
source: Unread
zh_hans: 未读

# widget.collectionTrend.using
source: In use
zh_hans: 使用中

# widget.collectionTrend.weeklyAverage
source: 12-week avg.
zh_hans: 12 周均值

# widget.common.openRepository
source: Open the repository in Starcat
zh_hans: 在 Starcat 中打开仓库

# widget.common.openStarcat
source: Open Starcat
zh_hans: 打开 Starcat

# widget.common.preparing.subtitle
source: Open Starcat to prepare your data.
zh_hans: 打开 Starcat 以准备数据。

# widget.common.preparing.title
source: Preparing Widgets
zh_hans: 正在准备小组件

# widget.common.signedOut.subtitle
source: Open Starcat and sign in to continue.
zh_hans: 打开 Starcat 并登录后继续。

# widget.common.signedOut.title
source: Sign In to Starcat
zh_hans: 登录 Starcat

# widget.common.stale
source: Data may be out of date
zh_hans: 数据可能已过期

# widget.common.unavailable.subtitle
source: Open Starcat to rebuild the widget snapshot.
zh_hans: 打开 Starcat 重新生成小组件快照。

# widget.common.unavailable.title
source: Data Unavailable
zh_hans: 数据暂不可用

# widget.common.upgrade.subtitle
source: Update Starcat to read this widget data.
zh_hans: 升级 Starcat 后读取这份小组件数据。

# widget.common.upgrade.title
source: Update Required
zh_hans: 需要升级

# widget.contribution.best
source: Best
zh_hans: 峰值

# widget.contribution.empty.subtitle
source: Open Starcat to sync your latest GitHub contribution data.
zh_hans: 打开 Starcat 同步最新 GitHub 贡献数据。

# widget.contribution.empty.title
source: Contribution Data Not Ready
zh_hans: 贡献数据尚未就绪

# widget.contribution.heatmap.description
source: Show your GitHub contribution activity over the past year.
zh_hans: 查看过去一年的 GitHub 贡献活跃度。

# widget.contribution.heatmap.displayName
source: Contribution Heatmap
zh_hans: 贡献热力图

# widget.contribution.openStarcat
source: Open Starcat to refresh contribution data
zh_hans: 打开 Starcat 刷新贡献数据

# widget.contribution.overview.accessibility %lld %lld %lld
source: Today %1$lld contributions, best day %2$lld, %3$lld total contributions in the past year
zh_hans: 今日 %1$lld 次贡献，单日峰值 %2$lld，过去一年共 %3$lld 次贡献

# widget.contribution.overview.description
source: See today's contributions, best day, total, heatmap, and activity mix.
zh_hans: 查看今日贡献、单日峰值、总数、热力图与活动结构。

# widget.contribution.overview.displayName
source: Contribution Overview
zh_hans: 贡献概览

# widget.contribution.radar.accessibility %lld %lld %lld %lld %lld
source: Commits %1$lld, issues %2$lld, pull requests %3$lld, reviews %4$lld, repositories %5$lld
zh_hans: 提交 %1$lld，Issue %2$lld，Pull Request %3$lld，评审 %4$lld，仓库 %5$lld

# widget.contribution.radar.commit
source: Commit
zh_hans: 提交

# widget.contribution.radar.description
source: Compare commits, issues, pull requests, reviews, and repositories.
zh_hans: 对比提交、Issue、Pull Request、评审与仓库贡献。

# widget.contribution.radar.displayName
source: Contribution Radar
zh_hans: 贡献雷达图

# widget.contribution.radar.pullRequest
source: Pull Req
zh_hans: Pull Request

# widget.contribution.radar.repository
source: Repo
zh_hans: 仓库

# widget.contribution.radar.review
source: Review
zh_hans: 评审

# widget.contribution.summary.accessibility %lld %lld
source: Today %1$lld contributions, %2$lld total contributions in the past year
zh_hans: 今日 %1$lld 次贡献，过去一年共 %2$lld 次贡献

# widget.contribution.summary.description
source: See your recent heatmap, today's contributions, and total contributions.
zh_hans: 查看近期贡献热力图、今日贡献与贡献总数。

# widget.contribution.summary.displayName
source: Contribution Summary
zh_hans: 贡献摘要

# widget.contribution.today
source: Today
zh_hans: 今日

# widget.contribution.total
source: Total
zh_hans: 总计

# widget.contribution.total.accessibility %lld
source: %lld contributions in the past year
zh_hans: 过去一年共 %lld 次贡献

# widget.focus.configuration.description
source: Choose a pinned or in-use repository, or let Starcat select automatically.
zh_hans: 选择置顶或正在使用的仓库，也可以让 Starcat 自动选择。

# widget.focus.configuration.repository
source: Repository
zh_hans: 仓库

# widget.focus.configuration.title
source: Configure Starcat Focus
zh_hans: 配置 Starcat Focus

# widget.focus.description
source: Keep pinned and in-use repositories within reach.
zh_hans: 随时查看置顶和正在使用的仓库。

# widget.focus.empty.subtitle
source: Pin a repository or mark it as in use in Starcat.
zh_hans: 在 Starcat 中置顶仓库，或将它标记为正在使用。

# widget.focus.empty.title
source: No Focus Repositories
zh_hans: 暂无 Focus 仓库

# widget.focus.entity.type
source: Starcat Repository
zh_hans: Starcat 仓库

# widget.focus.using
source: In Use
zh_hans: 使用中

# widget.rediscovery.description
source: Review one repository from your Starcat collection each day.
zh_hans: 每天回顾一个 Starcat 收藏仓库。

# widget.rediscovery.displayName
source: Repo Recall
zh_hans: 仓库回顾

# widget.rediscovery.empty.subtitle
source: Star more repositories and come back later.
zh_hans: 收藏更多仓库后再回来看看。

# widget.rediscovery.empty.title
source: No Repositories to Review Yet
zh_hans: 暂无可回顾的仓库

# widget.rediscovery.title
source: Repo Recall
zh_hans: 仓库回顾

# widget.releaseWatch.description
source: See unread releases from repositories you follow in Starcat.
zh_hans: 查看 Starcat 中已订阅仓库的未读 Release。

# widget.releaseWatch.empty.subtitle
source: New releases from subscribed repositories appear here.
zh_hans: 已订阅仓库的新 Release 会显示在这里。

# widget.releaseWatch.empty.title
source: No Unread Releases
zh_hans: 没有未读 Release

# widget.releaseWatch.openRelease
source: Open the Release timeline in Starcat
zh_hans: 在 Starcat 中打开对应 Release

# widget.releaseWatch.openTimeline
source: Open the Release timeline in Starcat
zh_hans: 在 Starcat 中打开 Release 时间线

# widget.releaseWatch.prerelease
source: Pre-release
zh_hans: 预发布

# widget.releaseWatch.unread %lld
source: %lld unread releases
zh_hans: %lld 个未读 Release

# widget.releaseWatch.unreadLabel
source: Unread releases
zh_hans: 未读 Release

# widget.releaseWatch.unreadShort %lld
source: %lld unread
zh_hans: %lld 未读

# agent.workspace.inspector.approval.tool
source: Tool
zh_hans: 工具

# agent.workspace.inspector.artifacts.characters
source: Characters
zh_hans: 字符数

# agent.workspace.inspector.artifacts.createdAt
source: Created
zh_hans: 创建时间

# agent.workspace.inspector.artifacts.list
source: Artifacts
zh_hans: 产出物

# agent.workspace.inspector.artifacts.markdownHint
source: The full Markdown result is displayed in the run surface.
zh_hans: 完整 Markdown 结果已在运行主区域展示。

# agent.workspace.inspector.artifacts.selected
source: Selected Artifact
zh_hans: 当前产出物

# agent.workspace.inspector.artifacts.toolCall
source: Tool Call
zh_hans: 关联工具调用

# agent.workspace.inspector.artifacts.type
source: Type
zh_hans: 类型

# agent.workspace.inspector.context.attachmentList
source: Attachments
zh_hans: 附件列表

# agent.workspace.inspector.context.attachments
source: Attachments
zh_hans: 附件

# agent.workspace.inspector.context.empty
source: Run context is not available yet.
zh_hans: 当前运行尚无可用上下文。

# agent.workspace.inspector.context.failure
source: Context Error
zh_hans: 上下文错误

# agent.workspace.inspector.context.generatedAt
source: Generated
zh_hans: 冻结时间

# agent.workspace.inspector.context.knowledgeEligible
source: Knowledge-ready
zh_hans: 可检索仓库

# agent.workspace.inspector.context.linkList
source: GitHub Links
zh_hans: GitHub 链接

# agent.workspace.inspector.context.links
source: GitHub Links
zh_hans: GitHub 链接

# agent.workspace.inspector.context.repositories
source: Repositories
zh_hans: 仓库

# agent.workspace.inspector.context.repositoryList
source: Frozen Repositories
zh_hans: 冻结仓库

# agent.workspace.inspector.context.snapshot
source: Context Snapshot
zh_hans: 上下文快照

# agent.workspace.inspector.context.source
source: Source
zh_hans: 来源

# agent.workspace.inspector.context.subtitle
source: Frozen repositories, files, and links
zh_hans: 本次运行冻结的仓库、文件与链接

# agent.workspace.inspector.context.webSearch
source: Web Search
zh_hans: 联网搜索

# agent.workspace.inspector.overview.active
source: Active
zh_hans: 进行中

# agent.workspace.inspector.overview.cachedTokens
source: Cached Tokens
zh_hans: 缓存 Token

# agent.workspace.inspector.overview.compactions
source: Compactions
zh_hans: 上下文压缩

# agent.workspace.inspector.overview.completed
source: Completed
zh_hans: 已完成

# agent.workspace.inspector.overview.cost
source: Estimated Cost
zh_hans: 预估费用

# agent.workspace.inspector.overview.duration
source: Duration
zh_hans: 运行时长

# agent.workspace.inspector.overview.events
source: Events
zh_hans: 事件

# agent.workspace.inspector.overview.execution
source: Execution
zh_hans: 执行概况

# agent.workspace.inspector.overview.failed
source: Failed
zh_hans: 失败

# agent.workspace.inspector.overview.inputTokens
source: Input Tokens
zh_hans: 输入 Token

# agent.workspace.inspector.overview.lastActivity
source: Last Activity
zh_hans: 最后活动

# agent.workspace.inspector.overview.model
source: Model
zh_hans: 模型

# agent.workspace.inspector.overview.provider
source: Provider
zh_hans: 服务商

# agent.workspace.inspector.overview.outputTokens
source: Output Tokens
zh_hans: 输出 Token

# agent.workspace.inspector.overview.reasoning
source: Reasoning Effort
zh_hans: 推理强度

# agent.workspace.inspector.overview.reasoningTokens
source: Reasoning Tokens
zh_hans: 推理 Token

# agent.workspace.inspector.overview.retries
source: Retries
zh_hans: 重试

# agent.workspace.inspector.overview.runtime
source: Runtime
zh_hans: 运行环境

# agent.workspace.inspector.overview.startedAt
source: Started
zh_hans: 开始时间

# agent.workspace.inspector.overview.steps
source: Steps
zh_hans: 步骤

# agent.workspace.inspector.overview.usage
source: Usage
zh_hans: 用量

# agent.workspace.inspector.step.attempt
source: Attempt
zh_hans: 尝试次数

# agent.workspace.inspector.step.back
source: Back
zh_hans: 返回

# agent.workspace.inspector.step.completedAt
source: Completed at
zh_hans: 完成时间

# agent.workspace.inspector.step.originalTitle
source: Original title
zh_hans: 原始标题

# agent.workspace.inspector.step.providerEvent
source: Runtime event
zh_hans: Runtime 事件

# agent.workspace.inspector.step.details
source: Step Details
zh_hans: 步骤详情

# agent.workspace.inspector.step.kind
source: Event Type
zh_hans: 事件类型

# agent.workspace.inspector.step.metadata
source: Event Metadata
zh_hans: 事件元数据

# agent.workspace.inspector.step.noDetails
source: The Runtime did not provide additional content for this event.
zh_hans: Runtime 没有为该事件提供更多内容。

# agent.workspace.inspector.step.parent
source: Parent Event
zh_hans: 父事件

# agent.workspace.inspector.step.sequence
source: Sequence
zh_hans: 序号

# agent.workspace.inspector.step.status
source: Status
zh_hans: 状态

# agent.workspace.inspector.step.subtitle
source: Selected runtime event and structured payload
zh_hans: 当前 Runtime 事件与结构化数据

# agent.workspace.inspector.tab.run
source: Run
zh_hans: 运行

# agent.workspace.inspector.tab.artifacts
source: Artifacts
zh_hans: 产出物

# agent.workspace.inspector.tab.context
source: Context
zh_hans: 上下文

# agent.workspace.inspector.tab.overview
source: Overview
zh_hans: 概览

# agent.workspace.inspector.value.disabled
source: Disabled
zh_hans: 关闭

# agent.workspace.inspector.value.enabled
source: Enabled
zh_hans: 开启

# agent.workspace.inspector.value.unavailable
source: Not provided
zh_hans: 未提供

# agent.workspace.inspector.overview.approvals
source: Approval Requests
zh_hans: 审批请求

# agent.workspace.inspector.overview.approved
source: Approved
zh_hans: 已批准

# agent.workspace.inspector.overview.artifacts
source: Artifacts
zh_hans: 产出物

# agent.workspace.inspector.overview.audit
source: Execution Audit
zh_hans: 执行审计

# agent.workspace.inspector.overview.cacheWriteTokens
source: Cache Write Tokens
zh_hans: 缓存写入 Token

# agent.workspace.inspector.overview.contextWindow
source: Context Window
zh_hans: 上下文窗口

# agent.workspace.inspector.overview.fileChanges
source: File Changes
zh_hans: 文件变更

# agent.workspace.inspector.overview.firstOutput
source: First Output
zh_hans: 首个输出延迟

# agent.workspace.inspector.overview.knowledgeAudits
source: Knowledge Audits
zh_hans: 知识检索审计

# agent.workspace.inspector.overview.rejected
source: Rejected
zh_hans: 已拒绝

# agent.workspace.inspector.overview.sources
source: Evidence Sources
zh_hans: 证据来源

# agent.workspace.inspector.overview.warnings
source: Warnings and Errors
zh_hans: 警告与错误

# agent.workspace.inspector.step.usage
source: Step Usage
zh_hans: 单步用量

# agent.workspace.trace.kind.tokenUsage
source: Token Usage
zh_hans: Token 用量

# agent.workspace.trace.tokenUsage.summaryFormat
source: %lld tokens used
zh_hans: 已使用 %lld Token

# agent.workspace.runtime.codexProviderHelp
source: Providers configured in Codex config.toml
zh_hans: Codex config.toml 中配置的服务商

# agent.workspace.runtime.codexEndpointUnavailable
source: The %@ endpoint is unavailable. Start its local bridge, then retry.
zh_hans: 无法连接 %@ 端点。请启动对应的本地桥接服务后重试。

# agent.workspace.runtime.codexCredentialBlocked
source: Unavailable in Starcat: Codex requires environment credential %1$@, which is not passed to the external Runtime.
zh_hans: Starcat 中不可用：Codex 需要环境凭据 %1$@，该凭据不会传给外部 Runtime。

# agent.workspace.runtime.deepSeekProviderHelp
source: Verified providers from Starcat AI settings
zh_hans: 来自 Starcat AI 设置的已验证服务商

# agent.workspace.runtime.noVerifiedProvider
source: No verified provider
zh_hans: 没有已验证的服务商

# agent.workspace.runtime.provider
source: Provider
zh_hans: 服务商

# agent.workspace.runtime.providerDefault
source: Provider Default
zh_hans: 服务商默认

# agent.workspace.runtime.providerRequired
source: Configure and verify an AI provider before using DeepSeek Harness.
zh_hans: 使用 DeepSeek Harness 前，请先配置并验证 AI 服务商。

# ai.client.error.invalidChatHistoryFormat
source: Invalid AI chat history: %@
zh_hans: AI 对话历史无效：%@
